# Вычислить число c заданной точностью d
# Пример:
# - при d = 0.001, π = 3.141
# Ввод: 0.01
# Вывод: 3.14

from math import pi

d = (input('Введите число для заданной точности π: '))
temp = d.split('.')
print(f'd = {d}, π = {round(pi, len(temp[1]))}')
